IDEA Open Model
RebarHookBase.AxisY Property
Compatible with IDEA StatiCa 20.1
 Gets or sets the position (direction) of the hook in 3D. It representa a Local Coordinate System. Hook lie in X-Y Plane. AxisX is defined by first/last segment of the rebar. AxisX and AxisY creates a plane where the hook lies.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public Vector3D AxisY { get; set; }
Public Property AxisY As Vector3D
	Get
	Set
Property Value
Type: Vector3D
See Also
Reference
RebarHookBase Class
IdeaRS.OpenModel.Model Namespace